# Data loading

In [1]:
import pandas as pd

In [3]:
data=pd.read_csv("daily-total-female-births-CA.csv")

In [4]:
data.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [7]:
data.dtypes # so here we are getting the date datatype as the object

date      object
births     int64
dtype: object

# Loading the dataset with parse_data

In [24]:
data=pd.read_csv("daily-total-female-births-CA.csv",parse_dates=[0],header=0) 
# mention the data column in the parse_dates.

In [25]:
data.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [26]:
data.dtypes # so here we are getting the data set in the datatime formate.

date      datetime64[ns]
births             int64
dtype: object

# Note

## In some cases there is diffculty while loading the data, so in that case we can use the date_prase parameter as well
## dataparse=lambda x:pd.datatime.strptime(x,'%Y-%m-%d %H:%M:%S')
## df=pd.read_csv(".....",data_parse=dataparse)

# Loading the dataset as series

In [19]:
df1=pd.read_csv("daily-total-female-births-CA.csv",header=0,index_col=0,parse_dates=[0],squeeze=True)

C:\Users\USER\AppData\Local\Temp\ipykernel_13768\535122371.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  df1=pd.read_csv("daily-total-female-births-CA.csv",header=0,index_col=0,parse_dates=[0],squeeze=True)

In [20]:
df1.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

 # slicing

In [23]:
print(df1['1959-01']) # getting jan month values

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

In [27]:
data[(data['date']>'1958-12-31') & (data['date']<'1959-02-1')]

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44
5  1959-01-06      29
6  1959-01-07      45
7  1959-01-08      43
8  1959-01-09      38
9  1959-01-10      27
10 1959-01-11      38
11 1959-01-12      33
12 1959-01-13      55
13 1959-01-14      47
14 1959-01-15      45
15 1959-01-16      37
16 1959-01-17      50
17 1959-01-18      43
18 1959-01-19      41
19 1959-01-20      52
20 1959-01-21      34
21 1959-01-22      53
22 1959-01-23      39
23 1959-01-24      32
24 1959-01-25      37
25 1959-01-26      43
26 1959-01-27      39
27 1959-01-28      35
28 1959-01-29      44
29 1959-01-30      38
30 1959-01-31      24